; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	satellite2 - satellite
	instrument5 - instrument
	instrument6 - instrument
	instrument7 - instrument
	thermograph0 - mode
	image1 - mode
	image2 - mode
	infrared3 - mode
	image4 - mode
	Star1 - direction
	Star3 - direction
	Star0 - direction
	Star4 - direction
	Star2 - direction
	Phenomenon5 - direction
	Phenomenon6 - direction
	Star7 - direction
	Planet8 - direction
	Planet9 - direction
	Phenomenon10 - direction
	Planet11 - direction
	Phenomenon12 - direction
)
(:init
	(supports instrument0 image4)
	(supports instrument0 infrared3)
	(calibration_target instrument0 Star2)
	(supports instrument1 thermograph0)
	(calibration_target instrument1 Star2)
	(supports instrument2 image1)
	(calibration_target instrument2 Star4)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star1)
	(supports instrument3 image2)
	(supports instrument3 thermograph0)
	(calibration_target instrument3 Star3)
	(supports instrument4 infrared3)
	(supports instrument4 image1)
	(calibration_target instrument4 Star0)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon5)
	(supports instrument5 image2)
	(supports instrument5 thermograph0)
	(supports instrument5 image1)
	(calibration_target instrument5 Star2)
	(supports instrument6 thermograph0)
	(supports instrument6 image2)
	(supports instrument6 image1)
	(calibration_target instrument6 Star4)
	(supports instrument7 thermograph0)
	(supports instrument7 infrared3)
	(calibration_target instrument7 Star2)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(on_board instrument7 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Phenomenon5)
)
(:goal (and
	(pointing satellite0 Star1)
	(pointing satellite1 Planet8)
	(have_image Phenomenon5 image4)
	(have_image Phenomenon6 image2)
	(have_image Star7 thermograph0)
	(have_image Planet8 thermograph0)
	(have_image Planet9 infrared3)
	(have_image Phenomenon10 image2)
	(have_image Planet11 image2)
	(have_image Phenomenon12 infrared3)
))

)

; plan
1. (turn_to satellite1 star3 phenomenon5)
   deleted: (pointing satellite1 phenomenon5)
   added: (pointing satellite1 star3)
   goals met: 1 of 10
2. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 1 of 10
3. (calibrate satellite1 instrument3 star3)
   added: (calibrated instrument3)
   goals met: 1 of 10
4. (turn_to satellite1 planet11 star3)
   deleted: (pointing satellite1 star3)
   added: (pointing satellite1 planet11)
   goals met: 1 of 10
5. (take_image satellite1 planet11 instrument3 image2)
   added: (have_image planet11 image2)
   goals met: 2 of 10
6. (turn_to satellite1 phenomenon6 planet11)
   deleted: (pointing satellite1 planet11)
   added: (pointing satellite1 phenomenon6)
   goals met: 2 of 10
7. (take_image satellite1 phenomenon6 instrument3 image2)
   added: (have_image phenomenon6 image2)
   goals met: 3 of 10
8. (turn_to satellite1 phenomenon10 phenomenon6)
   deleted: (pointing satellite1 phenomenon6)
   added: (pointing satellite1 phenomenon10)
   goals met: 3 of 10
9. (turn_to satellite0 star2 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 star2)
   goals met: 2 of 10
10. (take_image satellite1 phenomenon10 instrument3 image2)
   added: (have_image phenomenon10 image2)
   goals met: 3 of 10
11. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 3 of 10
12. (calibrate satellite0 instrument0 star2)
   added: (calibrated instrument0)
   goals met: 3 of 10
13. (turn_to satellite0 phenomenon12 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 phenomenon12)
   goals met: 3 of 10
14. (take_image satellite0 phenomenon12 instrument0 infrared3)
   added: (have_image phenomenon12 infrared3)
   goals met: 4 of 10
15. (turn_to satellite0 phenomenon5 phenomenon12)
   deleted: (pointing satellite0 phenomenon12)
   added: (pointing satellite0 phenomenon5)
   goals met: 4 of 10
16. (take_image satellite0 phenomenon5 instrument0 image4)
   added: (have_image phenomenon5 image4)
   goals met: 5 of 10
17. (turn_to satellite0 planet9 phenomenon5)
   deleted: (pointing satellite0 phenomenon5)
   added: (pointing satellite0 planet9)
   goals met: 5 of 10
18. (take_image satellite0 planet9 instrument0 infrared3)
   added: (have_image planet9 infrared3)
   goals met: 6 of 10
19. (turn_to satellite0 star1 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 star1)
   goals met: 7 of 10
20. (turn_to satellite1 star7 phenomenon10)
   deleted: (pointing satellite1 phenomenon10)
   added: (pointing satellite1 star7)
   goals met: 7 of 10
21. (take_image satellite1 star7 instrument3 thermograph0)
   added: (have_image star7 thermograph0)
   goals met: 8 of 10
22. (turn_to satellite1 planet8 star7)
   deleted: (pointing satellite1 star7)
   added: (pointing satellite1 planet8)
   goals met: 9 of 10
23. (take_image satellite1 planet8 instrument3 thermograph0)
   added: (have_image planet8 thermograph0)
   goals met: 10 of 10
